espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/zll-commissioning-client/zll-commissioning-client.c
/***************************************************************************//**
 * @file
 * @brief Routines for the ZLL Commissioning Client plugin, which implements the
 *        client side of the ZLL protocol.
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * The licensor of this software is Silicon Laboratories Inc. Your use of this
 * software is governed by the terms of Silicon Labs Master Software License
 * Agreement (MSLA) available at
 * www.silabs.com/about-us/legal/master-software-license-agreement. This
 * software is distributed to you in Source Code format and is governed by the
 * sections of the MSLA applicable to Source Code.
 *
 ******************************************************************************/

#include "app/framework/include/af.h"
#include "app/framework/util/af-main.h"
#include "app/framework/util/common.h"
#include  "mac-phy.h"

#ifdef UC_BUILD
#include "sl_signature_decode.h"
#include "sl_component_catalog.h"
#include "zll-commissioning.h"
#include "zll-commissioning-client-config.h"
#ifdef SL_CATALOG_ZIGBEE_NETWORK_CREATOR_PRESENT
#include "network-creator.h"
#define NETWORK_CREATOR_PRESENT
#endif
#ifdef SL_CATALOG_ZIGBEE_TEST_HARNESS_Z3_PRESENT
#include "test-harness-z3-zll.h"
#define TEST_HARNESS_Z3_PRESENT
#endif
#else // !UC_BUILD
#include "app/framework/plugin/zll-commissioning-common/zll-commissioning.h"
#ifdef EMBER_AF_PLUGIN_NETWORK_CREATOR
#include EMBER_AF_API_NETWORK_CREATOR
#define NETWORK_CREATOR_PRESENT
#endif
#ifdef EMBER_AF_PLUGIN_TEST_HARNESS_Z3
#include "app/framework/plugin/test-harness-z3/test-harness-z3-zll.h"
#define TEST_HARNESS_Z3_PRESENT
#endif
#endif // UC_BUILD

// The code below assumes that there is exactly one network and that it is
// ZigBee PRO.
#if EMBER_SUPPORTED_NETWORKS != 1
  #error ZLL is not supported with multiple networks.
#endif

//------------------------------------------------------------------------------
// Globals

#define ZLL_DEVICE_INFORMATION_RECORD_SIZE 16

#define isRequestingPriority(state) ((state) & EMBER_ZLL_STATE_LINK_PRIORITY_REQUEST)

static bool radioOnForRequestOnly = false;

#ifdef UC_BUILD
sl_zigbee_event_t emAfPluginZllCommissioningClientTouchLinkEvent;
#define touchLinkEvent &emAfPluginZllCommissioningClientTouchLinkEvent
#else // !UC_BUILD
EmberEventControl emberAfPluginZllCommissioningClientTouchLinkEventControl;
#define touchLinkEvent emberAfPluginZllCommissioningClientTouchLinkEventControl
#endif // UC_BUILD

static uint8_t currentChannel;
static int8_t rssi;

uint16_t emAfZllIdentifyDurationSec = EMBER_AF_PLUGIN_ZLL_COMMISSIONING_CLIENT_IDENTIFY_DURATION;

#ifdef PLUGIN_DEBUG
static const uint8_t emAfZllCommissioningPluginName[] = "ZLL Commissioning Client";
#define PLUGIN_NAME emAfZllCommissioningPluginName
#endif

static bool scanningPrimaryChannels = false;

// Module state
static enum {
  CLIENT_INITIAL,
  CLIENT_SCANNING,
  CLIENT_REQUESTING_INFO,
  CLIENT_AWAITING_RESPONSE,
  CLIENT_REQUESTING_IDENTITY,
  CLIENT_TOUCHLINKING,
} moduleState = CLIENT_INITIAL;

static uint8_t nextSubDeviceIndex = 0;

#ifdef EMBER_TEST
// Limit this delay for scripted tests, to prevent the transaction timing out,
// especially for a host side test.
  #define EMBER_AF_PLUGIN_ZLL_COMMISSIONING_TOUCH_LINK_MILLISECONDS_DELAY 2500
#else
  #define EMBER_AF_PLUGIN_ZLL_COMMISSIONING_TOUCH_LINK_MILLISECONDS_DELAY \
  (EMBER_AF_PLUGIN_ZLL_COMMISSIONING_CLIENT_TOUCH_LINK_SECONDS_DELAY * MILLISECOND_TICKS_PER_SECOND)
#endif

#define JOIN_RESPONSE_TIMEOUT_QS 20

// Parameters for Network Creator callbacks - note, for a client, we use the
// radio power defined for this plugin, not the power defined for the Network
// Creator plugin, in order that both client and server use the same power.
static EmberPanId networkCreatorPanId = 0xFFFF;
static int8_t networkCreatorRadioPower = EMBER_AF_PLUGIN_ZLL_COMMISSIONING_COMMON_RADIO_TX_POWER;

// Note, currently we set a random extended PAN ID for both client and server created
// networks during standard touchlink commissioning (even if the client wants otherwise.)

// Private ZLL commissioning functions
bool emAfZllAmFactoryNew(void);
EmberNodeType emAfZllGetLogicalNodeType(void);
void emAfZllTouchLinkComplete(void);

// Forward references
void emAfZllAbortTouchLink(EmberAfZllCommissioningStatus reason);

//------------------------------------------------------------------------------
// Module private functions

static uint32_t getChannelMask(void)
{
  uint32_t channelMask = 0;
  if (scanningPrimaryChannels) {
    channelMask = emberGetZllPrimaryChannelMask();
#ifdef SCAN_SECONDARY_CHANNELS
  } else {
    channelMask = emberGetZllSecondaryChannelMask();
#endif
  }
  debugPrintln("getChannelMask: mask = %4X, scanningPrimary = %d", channelMask, scanningPrimaryChannels);
  return channelMask;
}

static EmberStatus sendDeviceInformationRequest(uint8_t startIndex)
{
  EmberStatus status;
  (void) emberAfFillExternalBuffer((ZCL_CLUSTER_SPECIFIC_COMMAND
                                    | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER
                                    | ZCL_DISABLE_DEFAULT_RESPONSE_MASK),
                                   ZCL_ZLL_COMMISSIONING_CLUSTER_ID,
                                   ZCL_DEVICE_INFORMATION_REQUEST_COMMAND_ID,
                                   "wu",
                                   emAfZllNetwork.securityAlgorithm.transactionId,
                                   startIndex);
  status = emberAfSendCommandInterPan(0xFFFF,                // destination pan id
                                      emAfZllNetwork.eui64,
                                      EMBER_NULL_NODE_ID,    // node id - ignored
                                      0x0000,                // group id - ignored
                                      EMBER_ZLL_PROFILE_ID);
  if (status == EMBER_SUCCESS) {
    moduleState = CLIENT_AWAITING_RESPONSE;
    slxu_zigbee_event_set_delay_ms(touchLinkEvent,
                                   EMBER_AF_PLUGIN_ZLL_COMMISSIONING_TOUCH_LINK_MILLISECONDS_DELAY);
  } else {
    emberAfAppPrintln("%p%p failed 0x%x",
                      "Error: ",
                      "Device information request",
                      status);
  }
  return status;
}

static EmberStatus sendIdentifyRequest(uint16_t identifyDuration)
{
  EmberStatus status;
  (void) emberAfFillExternalBuffer((ZCL_CLUSTER_SPECIFIC_COMMAND
                                    | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER
                                    | ZCL_DISABLE_DEFAULT_RESPONSE_MASK),
                                   ZCL_ZLL_COMMISSIONING_CLUSTER_ID,
                                   ZCL_IDENTIFY_REQUEST_COMMAND_ID,
                                   "wv",
                                   emAfZllNetwork.securityAlgorithm.transactionId,
                                   identifyDuration);
  status = emberAfSendCommandInterPan(0xFFFF,                // destination pan id
                                      emAfZllNetwork.eui64,
                                      EMBER_NULL_NODE_ID,    // node id - ignored
                                      0x0000,                // group id - ignored
                                      EMBER_ZLL_PROFILE_ID);
  if (status != EMBER_SUCCESS) {
    emberAfAppPrintln("%p%p failed 0x%x",
                      "Error: ",
                      "Identify request",
                      status);
  }
  return status;
}

static EmberStatus sendResetToFactoryNewRequest(void)
{
  EmberStatus status;
  (void) emberAfFillExternalBuffer((ZCL_CLUSTER_SPECIFIC_COMMAND
                                    | ZCL_FRAME_CONTROL_CLIENT_TO_SERVER
                                    | ZCL_DISABLE_DEFAULT_RESPONSE_MASK),
                                   ZCL_ZLL_COMMISSIONING_CLUSTER_ID,
                                   ZCL_RESET_TO_FACTORY_NEW_REQUEST_COMMAND_ID,
                                   "w",
                                   emAfZllNetwork.securityAlgorithm.transactionId);
  status = emberAfSendCommandInterPan(0xFFFF,                // destination pan id
                                      emAfZllNetwork.eui64,
                                      EMBER_NULL_NODE_ID,    // node id - ignored
                                      0x0000,                // group id - ignored
                                      EMBER_ZLL_PROFILE_ID);
  if (status != EMBER_SUCCESS) {
    emberAfAppPrintln("%p%p failed 0x%x",
                      "Error: ",
                      "Reset to factory new request",
                      status);
  }
  return status;
}

