espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/zll-commissioning-client/zll-commissioning-client.c
#ifndef UC_BUILD

static void deviceInformationResponseHandler(const EmberEUI64 source,
                                             uint32_t transaction,
                                             uint8_t numberOfSubDevices,
                                             uint8_t startIndex,
                                             uint8_t deviceInformationRecordCount,
                                             uint8_t *deviceInformationRecordList)
{
  slxu_zigbee_event_set_inactive(touchLinkEvent);

  uint16_t deviceInformationRecordListLen = (deviceInformationRecordCount
                                             * ZLL_DEVICE_INFORMATION_RECORD_SIZE);
  uint16_t deviceInformationRecordListIndex = 0;
  uint8_t i;
  bool validResponse = ((emAfZllNetwork.securityAlgorithm.transactionId == transaction)
                        && MEMCOMPARE(emAfZllNetwork.eui64, source, EUI64_SIZE) == 0);

  emberAfZllCommissioningClusterFlush();
  emberAfZllCommissioningClusterPrint("RX: DeviceInformationResponse 0x%4x, 0x%x, 0x%x, 0x%x,",
                                      transaction,
                                      numberOfSubDevices,
                                      startIndex,
                                      deviceInformationRecordCount);
  emberAfZllCommissioningClusterFlush();
  for (i = 0; i < deviceInformationRecordCount; i++) {
    uint8_t *ieeeAddress;
    uint8_t endpointId;
    uint16_t profileId;
    uint16_t deviceId;
    uint8_t version;
    uint8_t groupIdCount;
    uint8_t sort;
    ieeeAddress = &deviceInformationRecordList[deviceInformationRecordListIndex];
    deviceInformationRecordListIndex += EUI64_SIZE;
    endpointId = emberAfGetInt8u(deviceInformationRecordList, deviceInformationRecordListIndex, deviceInformationRecordListLen);
    deviceInformationRecordListIndex++;
    profileId = emberAfGetInt16u(deviceInformationRecordList, deviceInformationRecordListIndex, deviceInformationRecordListLen);
    deviceInformationRecordListIndex += 2;
    deviceId = emberAfGetInt16u(deviceInformationRecordList, deviceInformationRecordListIndex, deviceInformationRecordListLen);
    deviceInformationRecordListIndex += 2;
    version = emberAfGetInt8u(deviceInformationRecordList, deviceInformationRecordListIndex, deviceInformationRecordListLen);
    deviceInformationRecordListIndex++;
    groupIdCount = emberAfGetInt8u(deviceInformationRecordList, deviceInformationRecordListIndex, deviceInformationRecordListLen);
    deviceInformationRecordListIndex++;
    sort = emberAfGetInt8u(deviceInformationRecordList, deviceInformationRecordListIndex, deviceInformationRecordListLen);
    deviceInformationRecordListIndex++;
    emberAfZllCommissioningClusterPrint(" [");
    emberAfZllCommissioningClusterDebugExec(emberAfPrintBigEndianEui64(ieeeAddress));
    emberAfZllCommissioningClusterPrint(" 0x%x 0x%2x 0x%2x 0x%x 0x%x 0x%x",
                                        endpointId,
                                        profileId,
                                        deviceId,
                                        version,
                                        groupIdCount,
                                        sort);
    emberAfZllCommissioningClusterFlush();

    if (validResponse
        && (emAfZllSubDeviceCount
            < EMBER_AF_PLUGIN_ZLL_COMMISSIONING_CLIENT_SUB_DEVICE_TABLE_SIZE)) {
      MEMMOVE(emAfZllSubDevices[emAfZllSubDeviceCount].ieeeAddress, ieeeAddress, EUI64_SIZE);
      emAfZllSubDevices[emAfZllSubDeviceCount].endpointId = endpointId;
      emAfZllSubDevices[emAfZllSubDeviceCount].profileId = profileId;
      emAfZllSubDevices[emAfZllSubDeviceCount].deviceId = deviceId;
      emAfZllSubDevices[emAfZllSubDeviceCount].version = version;
      emAfZllSubDevices[emAfZllSubDeviceCount].groupIdCount = groupIdCount;
      emAfZllSubDeviceCount++;
    } else {
      emberAfZllCommissioningClusterPrint(" (ignored)");
    }
    emberAfZllCommissioningClusterPrint("]");
    emberAfZllCommissioningClusterFlush();
  }
  emberAfZllCommissioningClusterPrintln("");

  if (validResponse
      && (emAfZllSubDeviceCount
          < EMBER_AF_PLUGIN_ZLL_COMMISSIONING_CLIENT_SUB_DEVICE_TABLE_SIZE)
      && emAfZllSubDeviceCount < numberOfSubDevices) {
    nextSubDeviceIndex = startIndex + deviceInformationRecordCount;
    moduleState = CLIENT_REQUESTING_INFO;
  } else {
    moduleState = CLIENT_REQUESTING_IDENTITY;

    if (radioOnForRequestOnly) {
      emberZllSetRadioIdleMode(EMBER_RADIO_POWER_MODE_OFF);
      radioOnForRequestOnly = false;
    }
  }
  slxu_zigbee_event_set_active(touchLinkEvent);
}

#else
static const sl_signature_t sl_zll_device_info_record_signature = {
  6,
  SL_SIGNATURE_FIELD_MASK_BLOB | EUI64_SIZE, offsetof(EmberZllDeviceInfoRecord, ieeeAddress),
  SL_SIGNATURE_FIELD_1_BYTE, offsetof(EmberZllDeviceInfoRecord, endpointId),
  SL_SIGNATURE_FIELD_2_BYTES, offsetof(EmberZllDeviceInfoRecord, profileId),
  SL_SIGNATURE_FIELD_2_BYTES, offsetof(EmberZllDeviceInfoRecord, deviceId),
  SL_SIGNATURE_FIELD_1_BYTE, offsetof(EmberZllDeviceInfoRecord, version),
  SL_SIGNATURE_FIELD_1_BYTE, offsetof(EmberZllDeviceInfoRecord, groupIdCount),
};
static void deviceInformationResponseHandler(const EmberEUI64 source,
                                             uint32_t transaction,
                                             uint8_t numberOfSubDevices,
                                             uint8_t startIndex,
                                             uint8_t deviceInformationRecordCount,
                                             uint8_t *deviceInformationRecordList)
{
  slxu_zigbee_event_set_inactive(touchLinkEvent);

  uint16_t deviceInformationRecordListLen = (deviceInformationRecordCount
                                             * ZLL_DEVICE_INFORMATION_RECORD_SIZE);
  uint8_t i;
  bool validResponse = ((emAfZllNetwork.securityAlgorithm.transactionId == transaction)
                        && MEMCOMPARE(emAfZllNetwork.eui64, source, EUI64_SIZE) == 0);

  emberAfZllCommissioningClusterFlush();
  emberAfZllCommissioningClusterPrint("RX: DeviceInformationResponse 0x%4x, 0x%x, 0x%x, 0x%x,",
                                      transaction,
                                      numberOfSubDevices,
                                      startIndex,
                                      deviceInformationRecordCount);
  emberAfZllCommissioningClusterFlush();
  for (i = 0; i < deviceInformationRecordCount; i++) {
    EmberZllDeviceInfoRecord tempDeviceInfoRecord;
    uint8_t sort;
    sl_signature_decode(deviceInformationRecordList,
                        deviceInformationRecordListLen,
                        i * (9 + EUI64_SIZE),
                        sl_zll_device_info_record_signature,
                        (uint8_t*)&tempDeviceInfoRecord);
    sort = emberAfGetInt8u(deviceInformationRecordList, (i + 1) * (9 + EUI64_SIZE) - 1, deviceInformationRecordListLen);
    emberAfZllCommissioningClusterPrint(" [");
    emberAfZllCommissioningClusterDebugExec(emberAfPrintBigEndianEui64(tempDeviceInfoRecord.ieeeAddress));
    emberAfZllCommissioningClusterPrint(" 0x%x 0x%2x 0x%2x 0x%x 0x%x 0x%x",
                                        tempDeviceInfoRecord.endpointId,
                                        tempDeviceInfoRecord.profileId,
                                        tempDeviceInfoRecord.deviceId,
                                        tempDeviceInfoRecord.version,
                                        tempDeviceInfoRecord.groupIdCount,
                                        sort);
    emberAfZllCommissioningClusterFlush();

    if (validResponse
        && (emAfZllSubDeviceCount
            < EMBER_AF_PLUGIN_ZLL_COMMISSIONING_CLIENT_SUB_DEVICE_TABLE_SIZE)) {
      memcpy(&(emAfZllSubDevices[emAfZllSubDeviceCount]), &tempDeviceInfoRecord, sizeof(EmberZllDeviceInfoRecord));
      emAfZllSubDeviceCount++;
    } else {
      emberAfZllCommissioningClusterPrint(" (ignored)");
    }
    emberAfZllCommissioningClusterPrint("]");
    emberAfZllCommissioningClusterFlush();
  }
  emberAfZllCommissioningClusterPrintln("");

  if (validResponse
      && (emAfZllSubDeviceCount
          < EMBER_AF_PLUGIN_ZLL_COMMISSIONING_CLIENT_SUB_DEVICE_TABLE_SIZE)
      && emAfZllSubDeviceCount < numberOfSubDevices) {
    nextSubDeviceIndex = startIndex + deviceInformationRecordCount;
    moduleState = CLIENT_REQUESTING_INFO;
  } else {
    moduleState = CLIENT_REQUESTING_IDENTITY;

    if (radioOnForRequestOnly) {
      emberZllSetRadioIdleMode(EMBER_RADIO_POWER_MODE_OFF);
      radioOnForRequestOnly = false;
    }
  }
  slxu_zigbee_event_set_active(touchLinkEvent);
}
#endif

static bool amInitiator(void)
{
  EmberTokTypeStackZllData token;
  emberZllGetTokenStackZllData(&token);
  return token.bitmask & EMBER_ZLL_STATE_ADDRESS_ASSIGNMENT_CAPABLE;
}

static EmberStatus startScan(uint8_t purpose)
{
  EmberStatus status = EMBER_INVALID_CALL;
  if (touchLinkInProgress()) {
    emberAfAppPrintln("%pTouch linking in progress", "Error: ");
  } else if (!amInitiator()) {
    emberAfAppPrintln("%pDevice is not an initiator", "Error: ");
  } else {
    emberAfZllSetInitialSecurityState();

    // Use the Ember API, not the framework API, otherwise host-side returns zero if network down
    currentChannel = emberGetRadioChannel();
    debugPrintln("startScan: purpose = %X, flags = %2X, current channel = %d", purpose, emAfZllFlags, currentChannel);

    scanningPrimaryChannels = true;
    uint32_t channelMask = getChannelMask();
    if (channelMask == 0) {
      // If there are no primary channels, then get the secondary mask.
      scanningPrimaryChannels = false;
      channelMask = getChannelMask();
    }

    if (channelMask != 0) {
      status = emberZllStartScan(channelMask,
                                 EMBER_AF_PLUGIN_ZLL_COMMISSIONING_CLIENT_SCAN_POWER_LEVEL,
                                 emAfZllGetLogicalNodeType());
      if (status == EMBER_SUCCESS) {
        emAfZllFlags = purpose;
        moduleState = CLIENT_SCANNING;
      } else {
        emberAfAppPrintln("%p%p%p0x%x",
                          "Error: ",
                          "Touch linking failed: ",
                          "could not start scan: ",
                          status);
      }
    } else {
      emberAfAppPrintln("%p%p0x%x",
                        "Error: ",
                        "Touch linking failed: ",
                        "no scan channels configured");
    }
  }
  return status;
}

static bool isSameNetwork(const EmberZllNetwork *network)
{
  EmberNodeType nodeType;
  EmberNetworkParameters parameters;
  EmberStatus status = emberAfGetNetworkParameters(&nodeType, &parameters);

