espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/zll-commissioning-client/zll-commissioning-client.c
  // Note, we only check the Extended Pan Id, not the Short Pan Id, nor the
  // Network Update Id.
  return (status == EMBER_SUCCESS
          && (MEMCOMPARE(parameters.extendedPanId,
                         network->zigbeeNetwork.extendedPanId,
                         EXTENDED_PAN_ID_SIZE) == 0));
}

static bool isTouchlinkPermitted(const EmberZllNetwork *networkInfo)
{
  // Basic checks for a Z3.0 touchlink initiator.
  if (networkInfo->nodeType == EMBER_UNKNOWN_DEVICE) {
    // The target must be a known device type.
    debugPrintln("isTouchlinkPermitted: Error - Target is unknown node type %d", networkInfo->nodeType);
    return false;
  }

  // Get current run-time network status. (Note that emberGetNodeType() may
  // report an actual node type even if a previous touchlink failed, e.g.
  // if the initiator was orphaned and was unable to rejoin)
  EmberNetworkStatus networkStatus = emberNetworkState();
  EmberCurrentSecurityState securityState;
  bool networkUp;

  if (networkStatus == EMBER_JOINED_NETWORK
      || networkStatus == EMBER_JOINED_NETWORK_NO_PARENT) {
    networkUp = true;
    if (emberGetCurrentSecurityState(&securityState) != EMBER_SUCCESS) {
      // It is possible that we're orphaned but attempting to rejoin here, but we'll
      // fail the touchlink anyway, since it would probably collide with the rejoining
      // procedure. (emberGetCurrentSecurityState() fails if we are rejoining even
      // though emberNetworkState() reports EMBER_JOINED_NETWORK_NO_PARENT)
      debugPrintln("emberGetCurrentSecurityState failure");
      return false;
    } else {
      // We're either joined or orphaned and not attempting to rejoin; in
      // either case we can proceed with the next stage of validation.
      debugPrintln("isTouchlinkPermitted: security bitmask = %2X,flags = %2X",
                   securityState.bitmask, emAfZllFlags);
    }
  } else {
    networkUp = false;
    debugPrintln("isTouchlinkPermitted: initiator is not joined");
  }

  if (scanForReset() || scanForTouchLink()) {
    // When scanning for touch linking or reset, the initiator need not be
    // on a network, but if it is, then it may not be on a different centralized
    // network, unless the (non-compliant) centralized network support is enabled.
    if (networkUp
        && (securityState.bitmask & EMBER_DISTRIBUTED_TRUST_CENTER_MODE) == 0
        && !isSameNetwork(networkInfo)) {
      debugPrintln("isTouchlinkPermitted: Error - Initiator on centralized network");
      return false;
    }
  }

  if (scanForTouchLink() && !networkUp) {
    // When scanning for touch linking, and if the initiator is not on a network,
    // either initiator or target must be able to form a network. If centralized
    // network touchlink initiating is supported, the initiating device must
    // be coordinator-capable.
    if (emAfZllGetLogicalNodeType() != EMBER_ROUTER && networkInfo->nodeType != EMBER_ROUTER) {
      debugPrintln("isTouchlinkPermitted: Error - Neither end can form a network");
      debugPrintln("our type = %d, their type = %d", emAfZllGetLogicalNodeType(), networkInfo->nodeType);
      return false;
    }
  }
  return true;
}

// Returns an integer greater than, equal to, or less than zero, according to
// whether target t1 is better than, equal to, or worse than target t2 in terms
// of requested priority with corrected signal strength serving as tiebreaker.
static int8_t targetCompare(const EmberZllNetwork *t1,
                            int8_t r1,
                            const EmberZllNetwork *t2,
                            int8_t r2)
{
  // When considering two targets, if only one has requested priority, that one
  // is chosen.
  if (isRequestingPriority(t1->state)
      && !isRequestingPriority(t2->state)) {
    return 1;
  } else if (!isRequestingPriority(t1->state)
             && isRequestingPriority(t2->state)) {
    return -1;
  }

  // If the priority of both targets is the same, the correct signal strength
  // is considered.  The strongest corrected signal wins.
  emberAfDebugPrintln("Signal strengths: r1 = %d, t1->corr = %d, r2 = %d, t2->corr = %d",
                      r1, t1->rssiCorrection, r2, t2->rssiCorrection);
  if (r1 + t1->rssiCorrection < r2 + t2->rssiCorrection) {
    return -1;
  } else if (r2 + t2->rssiCorrection < r1 + t1->rssiCorrection) {
    return 1;
  }

  // If we got here, both targets are considered equal.
  return 0;
}

static void processScanComplete(EmberStatus scanStatus)
{
  EmberStatus status;
  debugPrintln("processScanComplete - status = %X", scanStatus);

  if (scanStatus != EMBER_SUCCESS) {
    emberAfAppPrintln("%p%p0x%x",
                      "Error: ",
                      "Touch linking failed due to preemption: ",
                      scanStatus);

    // Factory new initiator preempted by an NFN initiator.
    emAfZllAbortTouchLink(EMBER_AF_ZLL_PREEMPTED_BY_STACK);

    if (emberZllGetRadioIdleMode() == EMBER_RADIO_POWER_MODE_OFF) {
      // Start a short rx-on period to cover an incoming network request.
      emberZllSetRxOnWhenIdle(JOIN_RESPONSE_TIMEOUT_QS * 250 * 2);
    }
  } else if (abortingTouchLink()) {
    debugPrintln("processScanComplete: aborted by application");
    emAfZllAbortTouchLink(EMBER_AF_ZLL_ABORTED_BY_APPLICATION);
  }

  if (touchLinkInProgress()) {
#ifdef SCAN_SECONDARY_CHANNELS
    if (scanningPrimaryChannels) {
      scanningPrimaryChannels = false;
      uint32_t channelMask = getChannelMask();
      if (channelMask != 0) {
        status = emberZllStartScan(channelMask,
                                   EMBER_AF_PLUGIN_ZLL_COMMISSIONING_CLIENT_SCAN_POWER_LEVEL,
                                   emAfZllGetLogicalNodeType());
        if (status == EMBER_SUCCESS) {
          // We will continue on the second scan complete callback.
          return;
        }
        emberAfAppPrintln("%p%p0x%x",
                          "Error: ",
                          "could not start secondary channel scan: ",
                          status);
      }
      debugPrintln("processScanComplete: no secondary channels, dropping thru");
    }
#endif // SCAN_SECONDARY_CHANNELS
    emAfZllFlags |= SCAN_COMPLETE;

