espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/zll-commissioning-client/zll-commissioning-client.c
    // Inform the API that scanning is complete for this transaction.
    emberZllScanningComplete();

    if (targetNetworkFound()) {
      status = emberSetLogicalAndRadioChannel(emAfZllNetwork.zigbeeNetwork.channel);
      if (status != EMBER_SUCCESS) {
        emberAfAppPrintln("%p%p%p0x%x",
                          "Error: ",
                          "Touch linking failed: ",
                          "could not change channel: ",
                          status);
        emAfZllAbortTouchLink(EMBER_AF_ZLL_CHANNEL_CHANGE_FAILED);
        return;
      }

      // When scanning for the purposes of touch linking or requesting device
      // information and the target has more than one sub device, turn the
      // receiver on (so we can actually receive the response) and send out the
      // first request.  If the target only has one sub device, its data will
      // have already been received in the ScanRequest.
      if ((scanForTouchLink() || scanForDeviceInformation())
          && emAfZllNetwork.numberSubDevices != 1) {
        debugPrintln("processScanComplete: sending first device info request");

        // Turn receiver on if it is currently off so we can receive
        // the Device Info Response.
        if (emberZllGetRadioIdleMode() == EMBER_RADIO_POWER_MODE_OFF) {
          if (emAfZllAmFactoryNew()) {
            // If we're factory new, start a short rx-on period to cover the request.
            emberZllSetRxOnWhenIdle(JOIN_RESPONSE_TIMEOUT_QS * 250);
          } else {
            // We're joined as a sleepy end-device - rx-on may be active and
            // suspended, or expired, or never started in the first place.
            emberZllSetRadioIdleMode(EMBER_RADIO_POWER_MODE_RX_ON);
            radioOnForRequestOnly = true;
          }
        }
        nextSubDeviceIndex = 0;
        moduleState = CLIENT_REQUESTING_INFO;
      } else {
        moduleState = CLIENT_REQUESTING_IDENTITY;
      }
      slxu_zigbee_event_set_active(touchLinkEvent);
    } else {
      emberAfAppPrintln("%p%p%p",
                        "Error: ",
                        "Touch linking failed: ",
                        "no networks were found");
      emAfZllAbortTouchLink(EMBER_AF_ZLL_NO_NETWORKS_FOUND);
    }
  } else {
    debugPrintln("processScanComplete: no touchlink in progress");
  }
}

//------------------------------------------------------------------------------
// ZLL commissioning private functions

void emAfZllAbortTouchLink(EmberAfZllCommissioningStatus reason)
{
  emAfZllFlags = INITIAL;
  moduleState = CLIENT_INITIAL;
  debugPrintln("emAfZllAbortTouchLink: reason = %d", reason);
  if (slxu_zigbee_event_is_active(touchLinkEvent)) {
    slxu_zigbee_event_set_inactive(touchLinkEvent);
    if (radioOnForRequestOnly) {
      emberZllSetRadioIdleMode(EMBER_RADIO_POWER_MODE_OFF);
      radioOnForRequestOnly = false;
    }
    sendIdentifyRequest(0x0000); // exit identify mode
  }
  EmberStatus status;
  if (emberNetworkState() == EMBER_JOINED_NETWORK
      || emberNetworkState() == EMBER_JOINED_NETWORK_NO_PARENT) {
    status = emberSetRadioChannel(currentChannel);
  } else {
    status = emberSetLogicalAndRadioChannel(currentChannel);
  }
  if (status != EMBER_SUCCESS) {
    emberAfAppPrintln("%p0x%x%p%d",
                      "Error: ",
                      status,
                      " - could not restore channel to: ",
                      currentChannel);
  }
  if (reason == EMBER_AF_ZLL_NETWORK_UPDATE_OPERATION) {
    emAfZllTouchLinkComplete();
  } else {
    emberAfPluginZllCommissioningTouchLinkFailedCallback(reason);
  }

  // Inform the API that scanning is complete for this transaction.
  emberZllScanningComplete();
}

#ifdef NETWORK_CREATOR_PRESENT
void emAfZllFinishNetworkFormationForRouter(EmberStatus status)
{
  if (status == EMBER_NETWORK_UP) {
    // Make ourselves not factory new, and reset the ZLL address and group space
    // we are using node id 0x0001 ourselves.
    EmberTokTypeStackZllData token;
    emberZllGetTokenStackZllData(&token);
    token.bitmask &= ~EMBER_ZLL_STATE_FACTORY_NEW;
    token.freeNodeIdMin = EMBER_ZLL_MIN_NODE_ID + 1;  // start with 0x0002
    token.freeNodeIdMax = EMBER_ZLL_MAX_NODE_ID;
    token.myGroupIdMin = (EMBER_ZLL_GROUP_ADDRESSES == 0
                          ? EMBER_ZLL_NULL_GROUP_ID
                          : EMBER_ZLL_MIN_GROUP_ID);
    token.freeGroupIdMin = EMBER_ZLL_MIN_GROUP_ID + EMBER_ZLL_GROUP_ADDRESSES;
    token.freeGroupIdMax = EMBER_ZLL_MAX_GROUP_ID;
    emberZllSetTokenStackZllData(&token);

    if (touchLinkInProgress()) {
      // Save the new channel.
      // (Use the Ember API, not the framework API, otherwise host-side returns zero if network down)
      currentChannel = emberGetRadioChannel();

      // Switch back to the target's current channel to send the network request,
      // in case we formed on a different one.
      emberSetLogicalAndRadioChannel(emAfZllNetwork.zigbeeNetwork.channel);

      // Set the target's new channel to our current channel.
      emAfZllNetwork.zigbeeNetwork.channel = currentChannel;

      debugPrintln("Zll Comm stack status: our chan = %d, target chan = %d", currentChannel, emAfZllNetwork.zigbeeNetwork.channel);

      // Kick the client touchlinking event.
#ifdef EMBER_TEST
      // Short delay to prevent beacon collision.
      slxu_zigbee_event_set_delay_ms(touchLinkEvent, 100);
#else
      slxu_zigbee_event_set_active(touchLinkEvent);
#endif // EMBER_TEST
    }
  } else if (touchLinkInProgress()) {
    emberAfAppPrintln("%p%p%p0x%x",
                      "Error: ",
                      "Touch linking failed: ",
                      "could not form network: ",
                      status);
    emAfZllAbortTouchLink(EMBER_AF_ZLL_NETWORK_FORMATION_FAILED);
  }
  emAfZllFlags &= ~FORMING_NETWORK;
}

extern uint32_t emAfPluginNetworkCreatorPrimaryChannelMask;
extern uint32_t emAfPluginNetworkCreatorSecondaryChannelMask;
EmberStatus emAfZllFormNetworkForRouterInitiator(uint8_t channel, int8_t radioPower, EmberPanId panId)
{
  EmberStatus status;

