espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/protocol/zigbee/app/framework/plugin/zll-commissioning-client/zll-commissioning-client.c
void ezspZllAddressAssignmentHandler(EmberZllAddressAssignment *addressInfo,
                                     uint8_t lastHopLqi,
                                     int8_t lastHopRssi)
{
  if (touchLinkInProgress()) {
    emAfZllNetwork.nodeId = addressInfo->nodeId;
  }
}

#ifdef UC_BUILD
void emAfZllAddressAssignmentCallback(const EmberZllAddressAssignment *addressInfo)
#else
void emberZllAddressAssignmentHandler(const EmberZllAddressAssignment *addressInfo)
#endif
{
  if (touchLinkInProgress()) {
    debugPrintln("emberZllAddressAssignmentHandler: node id = %2X", addressInfo->nodeId);
    emAfZllNetwork.nodeId = addressInfo->nodeId;
  }
}

void emberAfPluginZllCommissioningClientTouchLinkEventHandler(SLXU_UC_EVENT)
{
  EmberStatus status = EMBER_SUCCESS;
  slxu_zigbee_event_set_inactive(touchLinkEvent);
  debugPrintln("TouchlinkEventHandler: flags = %X", emAfZllFlags);

  if (!touchLinkInProgress()) {
    return;
  }

  switch (moduleState) {
    case CLIENT_REQUESTING_INFO:
      debugPrintln("EH: Sending device info request");
      status = sendDeviceInformationRequest(nextSubDeviceIndex);
      if (status != EMBER_SUCCESS) {
        emberAfAppPrintln("%p%p%p0x%x",
                          "Error: ",
                          "Touch linking failed: ",
                          "could not send device information request: ",
                          status);
        emAfZllAbortTouchLink(EMBER_AF_ZLL_SENDING_DEVICE_INFORMATION_REQUEST_FAILED);
      }
      break;

    case CLIENT_AWAITING_RESPONSE:
      // Timeout - give up.
      emberAfAppPrintln("%p%p%p0x%x",
                        "Error: ",
                        "Touch linking failed: ",
                        "no reply to device information request: ",
                        status);
      emAfZllAbortTouchLink(EMBER_AF_ZLL_SENDING_DEVICE_INFORMATION_REQUEST_FAILED);
      break;

    case CLIENT_REQUESTING_IDENTITY:
      debugPrintln("EH - Sending identify request");
      status = sendIdentifyRequest(emAfZllIdentifyDurationSec);
      if (status == EMBER_SUCCESS) {
        moduleState = CLIENT_TOUCHLINKING;
        slxu_zigbee_event_set_delay_ms(touchLinkEvent,
                                       EMBER_AF_PLUGIN_ZLL_COMMISSIONING_TOUCH_LINK_MILLISECONDS_DELAY);
      } else {
        emberAfAppPrintln("%p%p%p0x%x",
                          "Error: ",
                          "Touch linking failed: ",
                          "could not send identify request: ",
                          status);
        emAfZllAbortTouchLink(EMBER_AF_ZLL_SENDING_IDENTIFY_REQUEST_FAILED);
      }
      break;

    case CLIENT_TOUCHLINKING:
      status = sendIdentifyRequest(0);
      if (scanForTouchLink()) {
        debugPrintln("EH - Proceeding with touchlink");
        // If we are not factory new, we want to bring the target into our
        // existing network, so we set the channel to our own channel, either
        // our original channel, or the channel we formed on, if we are (were)
        // a factory-new router initiator.
        // Otherwise, we'll use whatever channel the target is on presently.
        if (!emAfZllAmFactoryNew()) {
          emAfZllNetwork.zigbeeNetwork.channel = currentChannel;
        }
#ifdef NETWORK_CREATOR_PRESENT
        else if (emAfCurrentZigbeeProNetwork != NULL
                 && emAfCurrentZigbeeProNetwork->nodeType <= EMBER_ROUTER) {
          // If we are factory new and a router, then we need to form a network
          // to become non-factory new. See the BDB spec's touchlink procedure
          // for an initiator, steps 13, 21 and 22.
          status = emAfZllFormNetworkForRouterInitiator(0,
                                                        EMBER_AF_PLUGIN_ZLL_COMMISSIONING_COMMON_RADIO_TX_POWER,
                                                        0xffff);
          if (status != EMBER_SUCCESS) {
            emberAfAppPrintln("%p%p%p0x%x",
                              "Error: ",
                              "Touch linking failed: ",
                              "could not start network formation: ",
                              status);
            emAfZllAbortTouchLink(EMBER_AF_ZLL_NETWORK_FORMATION_FAILED);
          }
          return;
        }
#endif // NETWORK_CREATOR_PRESENT
        else {
          // If we are a factory new (end device) initiator, then let the
          // target chose the channel.
          emAfZllNetwork.zigbeeNetwork.channel = 0;
        }
        emberAfZllSetInitialSecurityState();
        emberAfAppPrintln("%p%p%p",
                          "Sending ",
                          emAfZllAmFactoryNew() ? "start" : "join",
                          " request to target");
        emAfInitiatorRejoinRetryCount = 0;
        status = emberZllJoinTarget(&emAfZllNetwork);
        if (status == EMBER_SUCCESS) {
          // We're finished here; the touchlink completion is handled by
          // the stack status handler in zll-commissioning-common.c
          moduleState = CLIENT_INITIAL;
        } else {
          // Check that it's not a non-fatal status, for example, if
          // emberZllJoinTarget() is sending a network update.
          if (status == EMBER_OPERATION_IN_PROGRESS) {
            // Abort, but report touchlink complete to application.
            emAfZllAbortTouchLink(EMBER_AF_ZLL_NETWORK_UPDATE_OPERATION);
          } else {
            emberAfAppPrintln("%p%p%p0x%x",
                              "Error: ",
                              "Touch linking failed: ",
                              "could not send start/join: ",
                              status);
            emAfZllAbortTouchLink(EMBER_AF_ZLL_SENDING_START_JOIN_FAILED);
          }
        }
      } else {
        if (scanForReset()) {
          status = sendResetToFactoryNewRequest();
          if (status != EMBER_SUCCESS) {
            emberAfAppPrintln("%p%p%p0x%x",
                              "Error: ",
                              "Touch linking failed: ",
                              "could not send reset: ",
                              status);
            emAfZllAbortTouchLink(EMBER_AF_ZLL_SENDING_RESET_TO_FACTORY_NEW_REQUEST_FAILED);
          }
        }

        // For all non-link scan types.
        if (status == EMBER_SUCCESS) {
          emberSetRadioChannel(currentChannel);
          emAfZllTouchLinkComplete();
          moduleState = CLIENT_INITIAL;
        }
      }
      break;

    default:
      break;
  }
}

void emAfPluginZllCommissioningClientInitCallback(SLXU_INIT_ARG)
{
  SLXU_INIT_UNUSED_ARG;

  slxu_zigbee_event_init(touchLinkEvent,
                         emberAfPluginZllCommissioningClientTouchLinkEventHandler);
}

/** @brief Get Pan Id
 *
 * This callback is called when the Network Creator plugin needs the PAN ID for
 * the network it is about to create. By default, the callback will return a
 * random 16-bit value.
 *
 */
EmberPanId emberAfPluginNetworkCreatorGetPanIdCallback(void)
{
  return (networkCreatorPanId == 0xFFFF
          ? emberGetPseudoRandomNumber()
          : networkCreatorPanId);
}

/** @brief Get Power For Radio Channel
 *
 * This callback is called when the Network Creator plugin needs the radio power for
 * the network it is about to create. By default, the callback will use the radio
 * power specified in the relevant plugin option.
 *
 */
int8_t emberAfPluginNetworkCreatorGetRadioPowerCallback(void)
{
  return networkCreatorRadioPower;
}
